
<img src="https://github.com/urcuqui/Data-Science/blob/master/Utilities/pandas_logo.png?raw=true" >

__Author: Christian Camilo Urcuqui LÃ³pez__

__Date: 14 August 2018__


# Pandas

The project Pandas is an open source library which allows us to use data structures and data analysis for the Python language. The Panda's project URL is https://pandas.pydata.org/

In this notebook we will see the essential functions to apply data analysis through the Pandas library in Python, moreover, we will see the first steps in an EDA (Exploratory Data Analysis) approach since how load the data that we will use and until how search insights through the information. Pandas provides data structures and data manipulation tools to make data cleaning, an important process to apply in our data science projects.

The big difference between Pandas and NumPy is Pandas is designed with tabular or heterogeneous data, NumPy is focused to homogeneous numerical array data.

This nootebok allows us to introduce the data science world with Python, the content of the notebook is divided in the next sections:

- [Import](#Import)
- [Data Structures](#Data-Structures)
    - [Series](#Series)
    - [DataFrame](#DataFrame)    
- [Load data](#Load-data)
    - [Datasets available](#Datasets-available)
    - [Open source repositories](#Open-source-repositories)
- [Exploration](#Exploration)
- [Cleaning](#Cleaning)
- [References](#References)

## Import

In some open examples, the library is imported like the next code

In [2]:
import pandas as pd

In the same way we can also import other important objects like Series and DataFrame into the local namespace

In [3]:
from pandas import Series, DataFrame

## Data Structures

It is important to be comfortable with the next workhorse data structures: Series and DataFrame.

### Series

A Series is a one-dimensional array with a sequence of values and an associated array of data labels (index).

In [19]:
serie = pd.Series([3,-8,"a"])

In [20]:
serie

0     3
1    -8
2     a
dtype: object

Pay attention we have indexes associated with each value in the array.

In [22]:
# this is the way to print the values of our series object
serie.values

array([3, -8, 'a'], dtype=object)

In [23]:
# this is the way to print the indexes 
serie.index

RangeIndex(start=0, stop=3, step=1)

We can change the values associated to each index during the creation of the series object

In [23]:
serie =  pd.Series([3, -8, 3], index=['a', 'b', 'c'])
serie

a    3
b   -8
c    3
dtype: int64

In [25]:
serie.index

Index(['a', 'b', 'c'], dtype='object')

These indexes allow us to access the values

In [26]:
serie['a']

3

In [24]:
serie['c'] = 'k'
serie

a     3
b    -8
c     k
dtype: object

In [29]:
serie[['c','a','b']] # we use a list of indexes, we can use strings instead of integers

c     k
a     3
b    -8
dtype: object

In [4]:
serie = pd.Series([3, -8, 3], index=['a', 'b', 'c']) # in order to make filters and other operations we will only use numbers
serie[serie > 0]

a    3
c    3
dtype: int64

In [38]:
serie * 2

a     6
b   -16
c     6
dtype: int64

In [5]:
import numpy as np
np.exp(serie)

a    20.085537
b     0.000335
c    20.085537
dtype: float64

In [40]:
'b' in serie

True

In [41]:
'k' in serie

False

We can make a Python dictionary and assign it in a Series object

In [42]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah':5000}
series = Series(sdata)
series

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

Pay attention that the previous data dictionary was sorted by the Series Object, we can override this passing the dict keys in the order that we want to use it.

In [44]:
states = ['California','Ohio', 'Oregon', 'Texas']
series = Series(sdata, index=states)
series

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

See that in the previous example the values were located with their respective key into the dictionary, that is the reason that we have a NaN value for the 'California' index and the value 'Utah' wasn't included it.

Pandas provides us the methods to know the missing values in our dataset.

In [45]:
pd.isnull(series)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [46]:
pd.notnull(series)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In the same way the Series object provides us the previous methods.

In [48]:
series.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

The alignment of the indexes allows us to make operations between multiple Series objects.

In [53]:
series2 = Series(sdata)
print(series)
print()
print(series2)
print()
print(series + series2) ## in this case the results of any operation with NaN is NaN

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

The Series object has other attributes like its name and the name assigned to the index

In [54]:
series2.name = 'population'
series2.index.name = 'states'
series2

states
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: population, dtype: int64

As you saw we can access to the index attribute, so we can change all the indexes through this.

In [56]:
series2.index = ['Kuky', 'Icesi', 'Morty', 'Rick']
series2

Kuky     35000
Icesi    71000
Morty    16000
Rick      5000
Name: population, dtype: int64

## DataFrame

This data structure represents a rectangular table of data and contains an ordered collection of columns (dataset), each column could have different kind of value type (string, numeric, boolean). DataFrame has not only the indexes by rows it has indexes for their columns. The data is stored as one or more two-dimensional blocks rather than a list, dictionary, or another two dimensional array.

In [26]:
# this is one way to make a dataframe with the same number of rows by each column
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
data = DataFrame(data)
data

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Well, now the idea is to use the methods of Pandas and the attributes of the DataFrame in order to explore the information. The next method will print the first five registers, this is important because it allows us to print a first representation of the dataset.

In [27]:
data.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

You can sort the during the creation process of the DataFrame

In [60]:
DataFrame(data, columns=['year','pop', 'state'])

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

If we didn't declare the values in a column we will have NaN registers.

In [4]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame2 =  DataFrame(data, columns=['year','state', 'pop',  'debt'],
                   index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [11]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Like a Series object we can see the values in a specific column.

In [12]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [13]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

If we want to print the values in a specific row by the index we can use the attribute loc or use iloc.

+ loc() receives a string index or an array of string indexes
+ iloc() receives the position index or an array of position indexes (int)

In [14]:
frame2.loc['two']

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [6]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Columns can be modified by assignment. For example, the empty 'debt'  column could be assigned a scalar value or an array of values

In [9]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [12]:
# for this case the array or list must have the same lenght that match with length of the DataFrame
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [13]:
# look that in this case we use the index to illustrate where the value are going to be in the Data Frame
# and the rows that will not have values, which will have NaN
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

## Load data

We can have different situations in order to load the data to process in our data projects, such as, we can have the data in our local computer, we would like to load the data from an open repository by an specific URL, and the data are located in the cloud with some aditional steps to make in code (login-security and other activities related with the technnology).

### Datasets available

A lot of datasets are available in order to learn about the data science world, some libraries like scikit-learn and tensorflow allow us to load recononized datasets that have excellent tutorials, for example, in the next URL we can have the information about the datasets.

+ http://scikit-learn.org/stable/datasets/index.html

In [2]:
# we will load the data from the Boston datasets from the scikit learn 

from sklearn.datasets import load_boston
boston = load_boston()
print(boston.data.shape)

(506, 13)

### Open source repositories

Pandas has some methods to load the data in different shapes in a DataFrame 
We will use Iris dataset and the National Project, the data dictionaries can be found in these URLs:
+ https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.names
+ https://www.kaggle.com/nationalparkservice/park-biodiversity/data
+ https://archive.ics.uci.edu/ml/datasets/Car+Evaluation

The next code lines will download a dataset from the repository of the University of California and save it in a Dataframe

In [2]:
import pandas as pd

# the next code will load the data but without the column names, so in the second line we can define them
#df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', header=None)
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', 
                 header=None, names=["sepal_length","sepal_width", "petal_length","petal_width","class"])

# the idea with this dataset is to explore some elements through pandas that Iris does not provide, 
# such as categorical variables, specifically, the method provides with index_col to select what is the main column to identify
# each row
df_park = pd.read_csv('../datasets/parks.csv', index_col=['Park Code'], encoding='utf-8')

Another way is to save the dataset in your local computer in a csv file, the next code will do it

In [28]:
import requests 
import csv
data = requests.get('https://archive.ics.uci.edu/ml/machine-learning-databases/car/car.data')
with open("../datasets/name.csv", "w+") as f:
    writer = csv.writer(f)
    reader = csv.reader(data.text.splitlines())
    for row in reader:
        writer.writerow(row)

## Exploration

Know the datatypes for each column

In [7]:
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
class            object
dtype: object

Print the first three rows

In [40]:
df.head(3)

   sepal_length  sepal_width  petal_length  petal_width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa

In [64]:
df_park.head(3)

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

Get and print a specific row

In [41]:
df.iloc[0]

sepal_length            5.1
sepal_width             3.5
petal_length            1.4
petal_width             0.2
class           Iris-setosa
Name: 0, dtype: object

Get values through your dataframe's indexes:
+ loc() receives a string index or an array of string indexes
+ iloc() receives the position index or an array of position indexes (int)

In [80]:
print(df_park.loc["ACAD"])
print("")
print(df_park.loc[["ACAD","ARCH"]])
print("")
print(df_park.iloc[[1,2]])

Park Name    Acadia National Park
State                          ME
Acres                       47390
Latitude                    44.35
Longitude                  -68.21
Name: ACAD, dtype: object

                      Park Name State  Acres  Latitude  Longitude
Park Code
ACAD       Acadia National Park    ME  47390     44.35     -68.21
ARCH       Arches National Park    UT  76519     38.68    -109.57

                        Park Name State   Acres  Latitude  Longitude
Park Code
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

The next lines determine the number of rows and columns in the dataset, the specific number of rows and how get the column names.

In [89]:
print(df.shape)
print("")
print(len(df))
print("")
print(df_park.columns)
print("")
print(df.columns)

(150, 5)

150

Index(['Park Name', 'State', 'Acres', 'Latitude', 'Longitude'], dtype='object')

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'class'], dtype='object')

Get the data by column name and the number of rows to display

In [94]:
print(df_park['State'][:2])
print("")
print(df['sepal_length'][:5])
print("")
#see how the columns are maped in the data_frame and how we can call it
print(df_park.Acres.head(2))

Park Code
ACAD    ME
ARCH    UT
Name: State, dtype: object

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal_length, dtype: float64

Park Code
ACAD    47390
ARCH    76519
Name: Acres, dtype: int64

In our dataset of parks the column "Park Name" has a space separator between the words, one recommendation is to have a simple words connected by a character, for example we will use _ in the next code:

In [65]:
df_park.columns = [col.replace(' ','_').lower() for col in df_park.columns]
print(df_park.columns)

Index(['park_name', 'state', 'acres', 'latitude', 'longitude'], dtype='object')

If you need a subset of your data we can use the above methods, for example

In [6]:
df_park[['state','acres']][:3]

          state   acres
Park Code
ACAD         ME   47390
ARCH         UT   76519
BADL         SD  242756

Get and print a specific value in a row and column

In [13]:
print(df_park.state.iloc[2]) # note again that you can call the column and next use iloc method
print("-----")
print(df_park.state.iloc[[2]]) # it is totally different from the previous example, note that you are printing the object propierties

SD
-----
Park Code
BADL    SD
Name: state, dtype: object

Filtering the data by conditions through the columns and the values in rows (Similar to R)

In [15]:
df_park[df_park.state == 'UT']

                            park_name state   acres  latitude  longitude
Park Code
ARCH             Arches National Park    UT   76519     38.68    -109.57
BRCA       Bryce Canyon National Park    UT   35835     37.57    -112.18
CANY        Canyonlands National Park    UT  337598     38.20    -109.93
CARE       Capitol Reef National Park    UT  241904     38.20    -111.17
ZION               Zion National Park    UT  146598     37.30    -113.05

Some logical operators are:

+ ~ it is "not"
+ | it is "or"
+ & it is "and"

In [16]:
df_park[(df_park.latitude > 60) | (df_park.acres > (10**6))].head(3)

,park_name,state,acres,latitude,longitude
Park Code,,,,,
DENA,Denali National Park and Preserve,AK,3372402,63.33,-150.50
DEVA,Death Valley National Park,"CA, NV",4740912,36.24,-116.82
EVER,Everglades National Park,FL,1508538,25.32,-80.93

Get a count of the unique values of a column

In [35]:
print(df_park.shape)
len(df_park.park_name.unique()) # it allows to know that each park is unique in our dataset

(56, 5)

56

### lambda

It is another important concept to apply in the searching process, it allows us to have more complex querys.

In [19]:
# the next code provides the park's names with a length of 3
df_park[df_park['park_name'].str.split().apply(lambda x: len(x) == 3)].head(3)

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

## Cleaning

In some situations you have to work with datasets with bad values, due the problems originated in their registration process (by a human error or a machine failure), problems related to the integrity of the data, data format, and other kind of situations that influence in the information. It is an important activity because the future analyses depend of this work.

In [2]:
# for example, you have the next list of states, pay attention of the format and the values, are they ok?

states = ['  Alabama', 'Georgia!', 'georgia', 'Fl0rIda', 'south  Carolina##', 'West virginia?']

In [9]:
import re # regular expression package
def clean_strings(strings):
    result = []
    for value in strings:
        value = value.strip() # this method will erase all the whitespace characters by default
        value = re.sub('[!#?]', '', value) # it will return a string by replacing the leftmost non overlapping occurrences of pattern
        value = value.title() # it will change the first character in each word to Uppercase and remaining characters to Lowercase
        result.append(value)
    return result

In [10]:
print(clean_strings(states))

['Alabama', 'Georgia', 'Georgia', 'Fl0Rida', 'South  Carolina', 'West Virginia']

### Get only a dataframe without NA's

In a exploratory data analysis is important to know the rows that have non values, the aim is to explore what happened during the capture process and what will do to resolve it. two methods to help us are:

+ isin, https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.isin.html
+ isnull, https://pandas.pydata.org/pandas-docs/stable/generated/pandas.isnull.html

In [66]:
print("data without non values in the state feature")
print(df_park[df_park.state.isin(["WA","OR","CA"])].head())
print("")
print("data with non values")
print("")
print(df_park.isna().head())

data without non values in the state feature
                               park_name state   acres  latitude  longitude
Park Code
CHIS       Channel Islands National Park    CA  249561     34.01    -119.42
CRLA           Crater Lake National Park    OR  183224     42.94    -122.10
JOTR           Joshua Tree National Park    CA  789745     33.79    -115.90
LAVO       Lassen Volcanic National Park    CA  106372     40.49    -121.51
MORA         Mount Rainier National Park    WA  235625     46.85    -121.75

data with non values

           park_name  state  acres  latitude  longitude
Park Code
ACAD           False  False  False     False      False
ARCH           False  False  False     False      False
BADL           False  False  False     False      False
BIBE           False  False  False     False      False
BISC           False  False  False     False      False

## References

+ McKinney, W. (2012). Python for data analysis: Data wrangling with Pandas, NumPy, and IPython. " O'Reilly Media, Inc.".
+ https://www.kaggle.com/sohier/tutorial-accessing-data-with-pandas/
+ http://wavedatalab.github.io/datawithpython/munge.html